<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 默认全局消息 - 成功类
    |--------------------------------------------------------------------------
    |
    | 以下语言包，可以针对不通同语言版本的网站，提供便捷的提示信息展示！
    |
    */

    'success' => '操作成功！',
    'success_del' => '删除成功！',
    'success_sign_in' => '登录成功！',
    'success_sign_out' => '退出登录成功！',

    /*
    |--------------------------------------------------------------------------
    | 默认全局消息 - 失败类
    |--------------------------------------------------------------------------
    |
    |
    */

    'failure' => '操作失败！',
    'failure_del' => '删除失败！',
    'failure_sign_in' => '登录失败！',
    'failure_sign_in_auth' => '重新登录！',
    'failure_sign_out' => '退出登录失败！',
    'failure_exist_user' => '已存在用户！',
    'failure_exist_mobile' => '已存在手机号码！',
    'failure_exist_email' => '已存在邮箱地址！',

    /*
    |--------------------------------------------------------------------------
    | 默认全局消息 - 表单
    |--------------------------------------------------------------------------
    |
    | 以下语言包，可以针对不通同语言版本的网站，提供便捷的提示信息展示！
    |
    */

    'params_not_null' => '参数不能为空！',
    'params_invalid' => '无效参数！',
    'params_invalid_token' => '无效令牌！',

	/*
    |--------------------------------------------------------------------------
    | 默认全局消息 - 提示
    |--------------------------------------------------------------------------
    |
    | 以下语言包，可以针对不通同语言版本的网站，提供便捷的提示信息展示！
    |
    */
	'doing'			=> '处理中...',	
	'doing_failure' => '响应失败',		
];
