<?php

return [
    'tip'          =>  '用户名 / 邮箱 / 手机号码',
    'name'         =>  '用户登录',
    'code'         =>  '验证码',
    /*
    |--------------------------------------------------------------------------
    | 默认消息 - 注册类 - 成功
    |--------------------------------------------------------------------------
    |
    | 以下语言包，可以针对不通同语言版本的网站，提供便捷的提示信息展示！
    |
    */

    'success' 		=> 	'登录成功',

    /*
    |--------------------------------------------------------------------------
    | 默认消息 - 注册类 - 失败
    |--------------------------------------------------------------------------
    |
    |
    */

    'failure' 		            => 	'登录失败',
    'failure_existed_email' 	=> 	'登录邮箱不存在',
    'failure_existed_username' 	=> 	'登录用户名不存在',
    'failure_existed_mobile' 	=> 	'登录手机号码不存在',
	'failure_code'	            =>	'您输入验证码错误',


    /*
    |--------------------------------------------------------------------------
    | 默认消息 - 登录类 - 前端提示
    |--------------------------------------------------------------------------
    |
    |
    */
    'failure_tip1'      =>  '请输入有效的注册邮箱',
    'failure_tip2'      =>  '请输入用户名',
    'failure_tip3'      =>  '请输入有效的手机号码',
    'failure_tip4'      =>  '请您填写登录密码',
    'failure_tip5'      =>  '请您填写验证码',
    'failure_account'   =>  '请输入用户帐号',
];
