<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 默认消息 - 导航名称
    |--------------------------------------------------------------------------
    |
    | 以下语言包，可以针对不通同语言版本的网站，提供便捷的提示信息展示！
    |
    */
    'user_navigation_center'               =>   '会员中心',
    'user_navigation_log'                  =>   '日志中心',


    /*
    |--------------------------------------------------------------------------
    | 默认消息 - 定义名称
    |--------------------------------------------------------------------------
    |
    | 以下语言包，可以针对不通同语言版本的网站，提供便捷的提示信息展示！
    |
    */
    'define_name_role'                     =>   '用户组',
    'define_name_score'                    =>   '积分',
    'define_name_experience'               =>   '经验值',
    
];
